{
    "-1": [
        "I went through the drive thru at the Starbucks on Capital. I ordered a Grande nonfat mocha. She gave me a Venti.. With surprise I asked, is this my coffee? I ordered a Grande and she said, \"We are out of Grande cups.\" I said, \"Oh, I understand.\" I paid and left. I drank my coffee, it was good as always. However, I went to throw it away, when I saw it was doubled with another cup. It was a TALL! I paid for a Grande! I just got ripped off at a good yet expensive coffee shop. This is the first time this has happened to me at a Starbucks. I have always known them to take pride in company. Oh well... Guess it happens to everyone. Warning= BE CAREFUL. Look at your drink carefully. I will from now on.",
        "Ordered my usual tall iced doppio espresso with milk and hazelnut. Never paid more than $2.45. I get charged extra for sweetened flavoring, but was at the Los Banos, CA location and was charged an extra 55 cents for milk. I asked the barista at the window why I was charged for something that is provided for free at the counter and she said that because she filled it up to the rim. It was a tall drink. It wasn't even like I asked for a gallon of milk!!! The girl talked to me like I was dumb. I asked another barista a different day why I was charged for milk and she said I shouldn't have been charged. I'm so disappointed and the girl that charged me acted like I was trying to get something for free!!!",
        "Today, Friday November 25, 2011, I went to Starbucks located at 531 East Market St. Leesburg, VA 20175. I ordered grande latte and I had to wait so long because the person who was doing the drinks did 4 drinks for 4 people who came after me and placed their order after me. I told him that I placed my order before these people and what he did wasn't right. He said to me in a very rude way, \"I'll get your drink and you'll get the ** out of here\". He added, \"Starbucks doesn't want to have customers like you\". I was totally shocked by what he said and I asked that I want to speak to the store manager. I explained to the store manager (Dennis) what happened and I asked him to give me the corporate phone number. The store manager didn't do anything about what happened in his store."
    ],
    "0": [
        "Well, I have had a lot of issues using my Starbucks card. I called customer service to get a new card over a year ago and never received my card. I didn't have time to call and get a new card so I just didn't use it. Also, your customer service is God awful and I am upset that I go to Starbucks every week to get a coffee, as well as, my wife and I am never able to get the point. Next, I was never able to use my card on my birthday because it would not register that I have a free birthday drink. Thanks for that. It's just disappointing that this company can give two ** about the customer. Thanks for the ** service over the years. Lastly, try to get employees that have a better outlook on life. They all seem to be depressed. Thanks or should I say, \"No thanks.\"",
        "I received a gift card on 4/20/2023 but not able to use it today, 5/11/2023. I believe no one should purchase Starbucks gift card anymore, because this is the 2nd time I was not able to use a Starbucks gift card...the first time was a thank-you card from the coordinator of our church's Foster the City program; all of us \"support friends\" helping out the foster families with various tasks received a card but it turned out we were all told not to use it because for reasons unbeknownst to him the cards were invalid. Sadly it happened—again...this time I received a card from a trusted friend and the same happened. I already texted her and let her know what had happened. I'm having a bad feeling Starbucks is having some kind of scam. I'm so appreciative of my friend’s kind heart and texted her about the card because I feel uncomfortable about what Starbucks is doing and personally I will not purchase Starbucks gift cards in the future, anymore.",
        "I attempted to purchase a gift card from Starbucks (via online). During the process, the “System” indicated a problem on their end with the first Credit Card I tried to use for the purchase. I entered another credit card and was approved for the purchase. I received an email confirming this. I subsequently received an Email indicating all transactions were not approved, so no gift card would be issued. I checked my Credit Card info online and discovered both credit cards had been charged. I called Starbucks Customer Service and was told, \"That’s Unfortunate.\" My cards were charged but no card issued. I now have been charged twice for a gift card that will not be issued. Only response from Starbucks is \"That’s Unfortunate.” I have been stolen from by Starbucks."
    ],
    "1": [
        "Because the incompetent manager, **, at store no. 6723 does not like me, she called a cop on me and told the cop lies about me and said I was barred from the store and the other Starbucks in the district. Since when does a store manager dictate the policies for the district? On that same day, she served me coffee and a brownie a half hour before the cop showed up. She set me up. Before that happened, I was regular loyal customer, and I told my friends and relatives about this incident. They are going to cut up their gold cards.The worst part of this was that the fool manager and the cop yelled at me to get out of the store and the idiot cop did not want to hear my side. I was humiliated in front of the employees and the customers, and that moron, the district manager, won't help me and she loves her. I believe nobody at Starbucks will help me. Maybe it's a blessing in disguise that people find out about this horrible company, because there are better coffee companies out there.",
        "My wife went in to get two coffees. She must have picked up the wrong one that was mine. We left and went 5 miles down the road when I found out I got the wrong one, I went back and told your employee, **, I did not get what my order was so he proceeded to tell me I should have looked at the name on the cup and that was the way it was. I said, \"Don't you think you owe me an apology for their mistake?\" He said he owed me nothing and told me to leave the store. We have been going to that location since it has been opened. We spend on the average $200 to $300 per month with Starbucks. Needles to say, that came to a halt as of today. The store is at 2 Fairfield Blvd., Ponte Vedra Beach. ** is your great employee of the year. I will be calling your store manager tomorrow.",
        "I went to Starbucks in Indiana state (Henry Schricker travel plaza; store code 0403907) in 9/30/14 at 8:19 am. I ordered Ice caramel macchiato, cheese danish and juice Naked for a total $13.42. I paid by cash. I gave to cashier (her name **, her ID #**) $100 bill (only bill that I had). She gave my change $56.58 (the change suppose to be $86.58). I took money I started to count my change in front of her and told her that she gave me not enough, that she suppose to give me $30 more. Her answer kill me: \"I gave you all change; you lost it.\" I told her that I was not going anywhere, I was staying in front of her waiting for the order. She said that if I can't handle my money, it is my problem. I was in shock. Then I asked manager. \"The manager\" came right away. She even did not asked what was the problem. She took my change, took all money from the cashier, went on the back somewhere. And few minutes later they came back, gave me $46 (but took $56), and told me that their cashier has no extra money; everything is fine. "
    ],
    "2": [
        "Starbucks at 4801 West Maple Rd., Omaha, NE 68154 is very unhygienic. A fly landed on their closed dessert shelves. I went to the store to get some frappucino on my birthday. I frequent that store at least once a month for the last 5 years. My daughter and wife was with me. My daughter noticed a big fly in the cake dessert covered shelf. This fly appeared to be landing on many of the desserts. My 11-year old daughter brought this to the attention of a Starbuck service lady, but was given the brush off. I myself then brought this attention to the same lady a minute later. Initially she tried to brush me off as well, but when I insisted on knowing what she intended to do about it since it was very unhygienic. She then mentioned that once she complete making my order, she would remove the fly and all the desserts to the trash",
        "This is the first time I go to this store located in Bristol and 17th St in Santa Ana, California. The staff was rude, not a smile, very short. It is pretty evident that they were not trained for customer service. The floor was very filthy. It looked like it wasn´t cleaned in several days. It was dirty and coffee stains everywhere. We had to clean our table because it was dirty like the rest of the tables. My wife went to the restroom. She had to do her business standing up because it was so dirty that she didn´t dare to sit on the toilet. I will never go back to this store and maybe to Starbucks.",
        "More than once, I enjoy a coffee or tea with my wife and children on weekends and after school during the week. Every time I notice tables are not clean. You will see coffee stains, sugar spilled, and straw wrappers. And this is in almost every Starbucks I visit (West Palm Beach Okeechobee near I 95, City Place, PGA at the mall). So one day I sent an email to their customer service department and I got a very polite response with a coupon in the mail the following week. But it never changes, I go back time and time again and there's always the same problem. Starbucks is too busy, they are driven by sales and profits only, a clean space with clean tables seems to be the last of their worries I guess."
    ],
    "3": [
        "I am Michael, I live in Columbus, Ohio. I use a variety of Starbucks locations in this city and service at the individual shops seem to be very good. However navigating their website to sign up for the apps and phone pay is a circus. I am incredulous that a company who claims to care for their client base as this one does has seemingly no one paying any attention to detail or even who gives a damn about the customer. I guess they do not want my money. I can work with this. We also have several local coffee shops who have great coffee and I now will frequent them more often! Starbucks you are losing your customer base with no customer loyalty. Train your baristas to be good people persons while at work and fix the danged website!",
        "I have lived in my neighborhood for 15 years, and going to the local Starbucks on a weekly basis (that's a lot of money I've given them). The customer service had been pretty good during this time until the last few months. Most of the employees now working at the two Starbucks in my neighborhood are horrible, and don't seem to know a thing about good customer service. If you've ever done a Google search about customer service at Starbucks, you know what I'm talking about. There are numerous comments about how bad the customer service is, and I can definitely say that I agree 100%. ",
        "This STARBUCKS Location has the worst customer service out of all the locations in Palm and Beyer San Diego Ca 92154. I been Starbucks for years and now is time to say Good Bye! I noticed that employees are overwhelmed and they take it against customers. I noticed that they are unhappy stressed and I don’t want that negative experiences anymore. I’m tired of been getting wrong items and if I placed a mobile order that has been taken away by another customer or by a homeless. Starbucks needs to come up with a better plan to keep business running, customers but the most important thing is to keep employees happy and motivated in order to provide customer service and focus on their duties. I’m deleting my Starbucks app because I rather buy my espresso machine and make my own coffee from now on. I want to enjoy my coffee happier! Thank you."
    ],
    "4": [
        "Toasted Butterscotch Frapp is delicious!! Wish I could say the same about the sandwiches we bought this morning! Really VERY disgusting both to look at then spit out! Neither smelled good to begin with, and the buns on both were stale. Sausage was old on the chicken sausage biscuit, with no sign of chicken, unless you count a blob of goop! Bacon was not cooked properly on either that sandwich, nor the bacon egg cheese sandwich. Visibly inedible, we would not have risked the uncooked bacon and whatever other strange things were on there! Obviously, we DO want refund for this poor Starbucks ‘offering’. Unfortunately, did not have my Starbucks card with me, so had to charge Visa. Then the girl at the drive-thru window neglected to offer my receipt!",
        "I normally buy my Grande Pike at this Starbucks: 138 S Central Ave, Los Angeles, CA 90012. Today I decided to add bagel and cream cheese to complete my breakfast. I left and had to go back asap because the cream cheese given to me was an opened and used one. I asked for the Manager and she accommodated me but I had to say my piece to Chris who served me. I told him what was he even thinking about???? With all the plague all over the world why would you do that. He apologized but it never affected me because I don't know why he did that. Asked him why give me somebody else cream cheese??? What if it is contaminated. So how can I trust Starbucks now. Is that the training you have for your employees??? It is so Disgusting. I wish I could attach a picture of the  cream cheese. So consumers check what you buy all the time.",
        "I am suffering from a health condition where I cannot have cheese in my sandwich. As Starbucks has no \"no cheese sandwich\" option I usually ask the serving barista to remove the cheese from the sandwich before heating it up. This Starbucks is located in University Blvd W. (32207) at Jacksonville FL. The Barista did not want to remove the cheese and when I asked her nicely to do so she started mocking me like a 6 year old kid (except in a psychotic way). Then to top it all she literally \"destroyed\" my chicken sandwich just because I asked her (nicely) to take the cheese off. "
    ],
    "5": [
        "I went to my new, local Starbucks today with a gift certificate given to me by a friend. I have been a loyal customer of Starbucks since 1984 (30 years). I used to have coffee mailed to me every month here in Montana until we finally got a store many years ago. Imagine my utter surprise and disgust when I was told today: \"We are out of Thanksgiving Blend and won't be getting anymore in. We only have 8 oz. bags of Christmas Blend.\" WHAT??!! I can't buy a pound of the seasonal coffee I adore from ANY of my local Starbucks (freestanding or in Target or Barnes and Noble) because THEY AREN'T SELLING 1 LB BAGS OF THEIR SEASONAL COFFEE. This is the stupidest idea I've heard of. I had to go home and order my pound of Christmas blend online and have it sent to me in a week. Come on, Starbucks! You need to be about the coffee, first and foremost!!!",
        "I've been going to Starbucks for about 10 years. I don't know what's going on with these Utah stores but none of the stores make the coffees the same. I go to Clinton, Clearfield, Layton, Layton Smith's, Clinton Smith's, Riverdale, Ogden, and Farmington, I order the same thing throughout the year and the same Christmas flavor every year until they run out. More often than not the past 6 mos, my coffee tastes gross. I am paying premium price for crap. The beans are burnt with a horrible aftertaste, they don't add flavor. It tastes like milk with water, or it's not at the kid temp I order it at. Only one store has gotten the Christmas flavors right. This morning, I went to the ONLY store, 2100 South and State, SLC, that has made my Christmas flavor right and my \"go to\" right. ",
        "Here we go!! Every morning that I wake up all I want is 20 oz cup of dark roast coffee... is that too much to ask? I am so tired waiting in a thousands of lines for these non coffee drinkers ordering these non coffee drinks and microwave breakfast with pastries that look like they were made days ago. That's my life everyday a year ago!!! Starbucks is no longer a coffee shop!! Their focus now is to sell sweet and heavy calorie drinks for $5. Over 35 years ago the founder of Starbucks walked in his first location, driven to make the best roasted beans and serving the best tasting coffee. That foundation is long gone. If you're a social media queen and own a iPhone and love a pink drinks you made Starbucks a billion dollar company pushing the people that used to enjoy a cup coffee out!!"
    ],
    "6": [
        "After numerous complaints to Starbucks about an incident that occurred at the Indian Harbour Beach, Florida store, it's quite apparent that Starbucks does not care how customers are treated. Foul language is acceptable towards customers, telling customers to shut-up is also acceptable. Slamming customers is also okay, from the rude barista at the Starbucks in Indian Harbour Beach, Florida. Be careful of writing to corporate as you will be labeled as a troublemaker, by the manager. And if you think you were treated badly before, it gets worse if they are told who wrote to corporate. I will never go back to this location. The main barista has had numerous complaints and still has a job, disgusting!",
        "When ordering this morning I clearly asked for a Venti drink. After I waited for a while, they brought my Grande drink and I told the barista that I had ordered a Venti. She said that they had charged me for a Grande and I said \"OK, but I ordered a Venti\" the Barista \"not happy\" started making my drink again and went to the cashier and asked her something which I couldn't hear. When she brought my drink over, she said to go to the cashier to pay the difference. Me, being a customer service supervisor, know the importance of treating your customers with kindness and knowing that if we mess up, we take the loss. What happened here? They made $0.50 but made my experience at this location very disappointing. When someone makes a mistake, own up to it and don't make the customer feel embarrassed.",
        "Very bad customer service. The person who takes order does not smile and is rude. I asked if an over the counter sandwich can be heated and she rudely responded \"No\" with stern blunt voice, no apology whatsoever. I also asked another person working at the bar for water, he said \"one minute plz\" and then ignored me and started walking around the kitchen for 3 minutes or more. Finally, I went back to the order area to order water, the new barista was polite and addressed the request. Overall, very rude staff, worst staff ever seen at Starbucks. No outlets either. This experience has made me never go to a Starbucks again, ever! Specially after the horrific thing they were in the news for. I usually don't believe everything that they say in the news but given my own personal experience, I think this Starbucks at Cypress Park, Los Angeles, CA has racist staff."
    ],
    "7": [
        "I want to share my tragically experience, on Sept 11/2021, I order coffee through drive through and when I reach through the window, she hand me the coffee which after I grab it, open from the lid falling on my hand and arm burning it, and felt all over my car door. Immediately I request speaking to the manager expecting he will instruct me to go to the Dr. and follow a report. Instead he approach with a little piece of paper and told me to write my name and phone number and someone will contact me. They contacted me 2 days later to offer me a $25.00 gift card, and told me that was my fault since the coffee was on my hand, which I told her to keep it, since I will never buy anything from them due to my bad experience.",
        "I ordered a Venti Pike Blend coffee on October 22, 2015 via drive through. The cup was faulty, was completely soaked around the top part of the cup and the lid was not able to hold the coffee. Unaware of this, I took a drink and the hot coffee went all over the front of me ruining my brand new camel hair coat. My leather interior was soaked and reeked of coffee as well. I telephoned the store in Canonsburg, PA where the coffee was purchased. The assistant manager answered the call. I explained to her what had just happened. She said \"I can't do anything about your coat and I can't do anything about your interior. Call corporate.\" and with that she hung up. This manager has always treated me rudely. I wrote a letter to \"corporate,\" along with four (4) 8x10 COLOR photographs of the cup. ",
        "I am VERY upset with my experience today. I ordered a Americana at the drive through at a very slow time. I paid lady with app and then she disappeared, I waited extra long and then a man came and handed me my drink after someone else was behind me on the drive through. When I picked up my drink for first time while driving the lid popped off and the coffee spilled on my hand burning it, my lap, my envelope I was mailing with a check, my car and car seat. I am lucky I did not get into an accident. I called store and spoke with manager to tell her what happened. I am very offended by her response, she said sorry and explained how it could not possibly be their fault because they triple check the lid. OBVIOUSLY they did not and I should not have had to argue with her. "
    ],
    "8": [
        "Despite customer traffic being slow, I had to wait a prolonged period of time to order a fast food Starbucks cookie bar. As I waiting to order a fast food Starbucks snack, the cashier was harassing me and purposely making me wait for a prolonged period of time when it wasn't busy. I have been to this location on a variety of locations and have never experienced such immature service. I ordered a gingerbread biscotti. It occurred on the date of 11/30/2021 at 9:28 am.",
        "We are at MCO Orlando airport by gates 1-9. I waited 30 minutes in line to find out there was no bold blend. The girl behind the counter asked me if I wanted to wait 7-10 mins for them to brew a pot. I told her no, that I’d already waited 30. (There were 6 employees behind the counter but I think only two working - in fact I walked up to the second register when a customer left and the girl there told me she wasn’t open). So I finally got my two pikes ventis - had to charge thru my Starbucks Acct because I wasn’t going to wait in that line again and not enough cash for two coffees..",
        "This location is notorious for how bad service they provide on weekends. I went there on 10/24/15 at about 6am. I went to the drive-thru line and was about 3 cars back from the order system. I waited in line for about 5-6 minutes with no moment what so ever. I got out of line and parked instead to run in for quicker service. I stood in line with 4 people ahead of me. There were about 6 people that I could see working, one of which was at the register. I stood in line for another 4 minutes with no movement again, so I left. I wasted almost 10 minutes just waiting in those lines. There was no sense of urgency in the staff when I went in."
    ],
    "9": [
        "I typically order only one thing - iced caramel macchiato. This is one of the simplest drinks they can make. Ice, vanilla syrup, milk, espresso, caramel drizzle on top. Simple, right? Well, apparently not. I have ordered this drink and been kicked with a bitterness because they DON'T ADD THE SYRUP! I would put this down to someone poorly trained at one location, but it has happened at three in my area. ",
        "We ordered online & paid but they lost order so I had to reorder & pay while my daughter tried to get her refund from first order... Then they mangled the order she requested a Caramel macchiato but they didn’t mix it. Caramel sat on bottom & they just poured milk in it... I ordered strawberry refresher with extra strawberry & somehow they made it slightly bitter! I heard them express to a man that waited for 20 min for plain black coffee that they where trying but didn’t really know how to make coffee! Seriously???? This terrible! Don’t go to Mad River store near Dayton mall. They suck!!!!",
        "I would like to tell you about the absolutely humiliating experience I had at one of your stores approximately an hour ago. I ordered a venti iced caramel macchiato with cream, when my order was called it was an iced coffee with mocha something. I repeated my order and the young man who had finished making my coffee said why I don't I take it anyway? I replied \"I didn't want that, thank you\" and repeated my order. I was then made an iced coffee, plain, that had some caramel drizzled over the top of it. I asked did the caramel macchiato not have actual caramel in it? That this coffee looked like a plain iced coffee with some caramel drizzled on top? One of the girls making coffee said that's exactly how we're supposed to make them and thrust the Starbucks recipe book at me and told me to look it up if I didn't believe her. "
    ],
    "10": [
        "I live in Grove City, Ohio and our Starbucks employees are awesome and friendly! I go there so much they know me. So my complaint isn't about our franchises here or the employees. I am bored of the choices that are offered and I think the Mocha Coconut Frappe should be brought back! It's cool and refreshing and not too rich. It seems that if you don't like caramel, your choices are pretty limited, which I find annoying. I always look forward to the change of seasons to see what new things you're going to have but lately it's just the same stuff over and over again! So, I have resorted to trying frozen coffee drinks elsewhere because it's something different! And they are cheaper! I want the Mocha Coconut brought back along with the Mocha Malt Frappe that you had summer 8 years ago or so. It was very, very good!",
        "I was a regular customer, ended up hating Starbucks due to their poor customer service and unkept promises. Let me write down what I have gone through: 1. Collected stickers (18 beverages) to collect 2019 Planner/Organizer. (Completed 4 Sets). 2. I have redeemed 2 of them. By February, their stocks were low, and choices were limited. The barista told me to wait for \"restocking\" for more choices. 3. By March, there were ZERO stocks and I was not able to collect 2 Planners. Baristas told me two choices: a) Wait until May; or b) Get 1,500 Php = 29.33 USD for each set. I decided to wait knowing that I have collected these stickers for the planner/organizer. I have spent more than 3,000Php per set and it does not compensate me with 1,500Php.",
        "I frequent about 10 Starbucks in the Richmond Virginia area. I noted that prices have risen 10% in the past year but I still buy. It seems that now in 2020 8 out of 10 times when I purchase a Venti coffee, the cup is only partially filled. Most times 2 inches short. I ask for whipped cream but rarely get it. If I don’t make them open the cup before they hand it to me to verify the drink, I have to call and or go back through the drive thru to have them fix it. Seems I am paying for a Venti but get a Grande most times. Since the happens across multiple stores, it seems to be the new business model requiring the customer to QA the quantity and quality of the order. I think Starbucks has started to decline and is now out priced themselves in the market. The “Coffee Experience” is no more when you can’t trust them when you place an order."
    ]
}